Revit 2016 API
FabricationConfiguration.LoadServices Method
 Loads the specified fabrication services into the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public void LoadServices(
	IList<int> serviceIds
)
Visual Basic
Public Sub LoadServices ( _
	serviceIds As IList(Of Integer) _
)
Visual C++
public:
void LoadServices(
	IList<int>^ serviceIds
)
Parameters
serviceIds
Type: System.Collections.Generic.IList<Int32>
 The ids of the fabrication services to load.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The current fabrication workspace is not connected and updated to source configuration, please reload and try again. -or- this operation failed.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace